Revit 2027 API
ViewSheetSetting.Save Method
Save the changes for the current view sheet set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Save()
Public Function Save As Boolean
public:
bool Save()
member Save : unit -> bool
Return Value
Boolean
False if save operation fails, otherwise True.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the current view sheet set is In-Session or the current view sheet set is unchanged.
See Also
Reference
ViewSheetSetting Class
Autodesk.Revit.DB Namespace